"""Программа запрашивает у пользователя строку чисел, разделённых пробелом.
При нажатии Enter должна выводиться сумма чисел. Пользователь может
 продолжить ввод чисел, разделённых пробелом и снова нажать Enter.
 Сумма вновь введённых чисел будет добавляться к уже подсчитанной сумме.
Но если вместо числа вводится специальный символ, выполнение программы
завершается.
Если специальный символ введён после нескольких чисел, то вначале нужно
добавить сумму этих чисел к полученной ранее сумме и после этого
завершить программу."""
""" Почему нельзя вынести input? почему зацикливается"""

def calc(calc_sum=0):
    l = input("Введите числа через пробел: ").split(' ')
    print("Для остановки напишите: s")
    for i in range(len(l)):
        if l[i] != "s":
            calc_sum = calc_sum + int(l[i])
        else:
            break
    print(calc_sum)
    if "s" in l:
        exit("stop")
    else:
        calc(calc_sum)
calc()

