"""Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить, к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и dict."""

m = int(input("Введите номер месяца: "))
my_l = ["Зима","Весна","Лето","Осень"]
my_d = {0: "Зима", 1: "Весна", 2: "Лето", 3: "Осень"}
if m in (3,4,5):
    print(f"Месяц список: {my_l[1]}")
    print(f"Месяц словарь: {my_d.get(1)}")
elif m in (6,7,8):
    print(f"Месяц список: {my_l[2]}")
    print(f"Месяц словарь: {my_d.get(2)}")
elif m in (9,10,11):
    print(f"Месяц список: {my_l[3]}")
    print(f"Месяц словарь: {my_d.get(3)}")
else:
    print(f"Месяц список: {my_l[0]}")
    print(f"Месяц словарь: {my_d.get(0)}")
