"""Пользователь вводит строку из нескольких слов, разделённых пробелами.
Вывести каждое слово с новой строки. Строки нужно пронумеровать.
Если слово длинное, выводить только первые 10 букв в слове."""

my_l = input("Введите слова через пробел: ").split(' ')
for i, w in enumerate(my_l, 1):
    print(f'{i} {w[:10]}')