""" Если фирма отработала с прибылью, вычислите рентабельность выручки.
Это отношение прибыли к выручке. Далее запросите численность сотрудников фирмы
и определите прибыль фирмы в расчёте на одного сотрудника."""

revenue = int(input("Укажите текущую выручку Вашей фирмы: "))
cost = int(input("Укажите текущие расходы Вашей фирмы: "))
profit = revenue - cost
roi = profit / revenue * 100
if profit > 0:
    print(f"Прибыль Вашей компании: {profit}")
    print(f"Рентабельность Вашей компании: {roi:.2f}%")
    count_empl = int(input("Какая численность сотрудников в Вашей компании? "))
    profit_empl = profit / count_empl
    print(f"Доля прибыли на одного сотрудника: {profit_empl}")
elif profit < 0:
    print(f"Убыток Вашей компании: {profit}")
else:
    print(f"Вы сработали в ноль")
