""". Программа принимает действительное положительное число x и целое отрицательное число y.
Выполните возведение числа x в степень y. Задание реализуйте в виде функции my_func(x, y).
При решении задания нужно обойтись без встроенной функции возведения числа в степень.
Подсказка: попробуйте решить задачу двумя способами.
Первый — возведение в степень с помощью оператора **.
Второй — более сложная реализация без оператора **,
предусматривающая использование цикла."""

"""Вариант 1"""
def my_func(x, y):
    return x ** y
x = int(input("число 1 "))
y = int(input("число 2 "))
print(my_func(x, y))

"""Вариант 2"""
x = int(input("число 1 "))
y = int(input("число 2 "))
def my_func(x, y):
    try:
        if y < 0:
            while y < 0:
                res = 1 / x
                x *= x
                y += 1
            return res
        else:
            return "Введите отрицательное число"
    except ValueError:
        print("Пожалуйста, вводите только числа")
print(my_func(x, y))






