"""Спортсмен занимается ежедневными пробежками.
В первый день его результат составил a километров.
Каждый день спортсмен увеличивал результат на 10% относительно предыдущего.
Требуется определить номер дня, на который результат спортсмена составит не
менее b километров. Программа должна принимать значения параметров a и b и
выводить одно натуральное число — номер дня."""

a = int(input("Введите результат в км в первый день тренировки: "))
b = int(input("Введите целевой результат в км: "))
day_num = 1
while a > b:
    b = int(input("Ваш целевой результат меньше результата перваго дня. "
                  "Введите новый целевой результат в км: : "))
while a < b:
    day_num += 1
    a *= 1.1
print(f"Ответ: на {day_num}-й день спортсмен достиг результата — не менее {b} км.")