"""Реализовать функцию, принимающую два числа (позиционные аргументы) и
выполняющую их деление. Числа запрашивать у пользователя, предусмотреть обработку
ситуации деления на ноль."""

f_num = input("Введите первое число: ")
s_num = input("Введите второе число: ")
def div (f, s):
    try:
        return int(f)/int(s)
    except ZeroDivisionError:
        return "Ошибка! Деление на ноль!"
try:
    print(div(f_num, s_num))
except ValueError:
    print("Недопустиое значение, вводите только числа")
