"""Создать список и заполнить его элементами различных типов данных.
Реализовать скрипт проверки типа данных каждого элемента.
Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать
у пользователя, а указать явно, в программе."""

my_list = ["ghfgj",4565,0.4546,"23445",None,False]
for lett in my_list:
    print(type(lett))