"""Реализовать два небольших скрипта:
итератор, генерирующий целые числа, начиная с указанного;
итератор, повторяющий элементы некоторого списка, определённого заранее.
Подсказка: используйте функцию count() и cycle() модуля itertools.
Обратите внимание, что создаваемый цикл не должен быть бесконечным.
Предусмотрите условие его завершения. #### Например, в первом задании
выводим целые числа, начиная с 3. При достижении числа 10 — завершаем цикл.
Вторым пунктом необходимо предусмотреть условие, при котором повторение
элементов списка прекратится."""

from itertools import count, cycle

a = int(input("С какого числа начать "))
b = int(input("Каким числом закончить "))

lst = []

for i in count(a):
    if i > b:
        break
    lst.append(i)

print(lst)

c = 0
for i in cycle(lst):
    if c >= len(lst):
        break
    print(i)
    c += 1