"""Продолжить работу над заданием. В программу должна попадать строка из слов,
 разделённых пробелом. Каждое слово состоит из латинских букв в нижнем
 регистре. Нужно сделать вывод исходной строки, но каждое слово должно
  начинаться с заглавной буквы. Используйте написанную ранее функцию
  int_func()"""

"""Как убрать None?"""

l = input("Введите слова через пробел: ").split(' ')
def int_func(str):
    return str.title()

def lst_func(lst):
    lst_n = []
    for i in lst:
        lst_n.append(int_func(i))
    print(*lst_n)
print(lst_func(l))
