"""Выполнить функцию, которая принимает несколько параметров,
описывающих данные пользователя: имя, фамилия, год рождения, город проживания,
email, телефон. Функция должна принимать параметры как именованные аргументы.
Осуществить вывод данных о пользователе одной строкой."""

def inf(name, last_n, y_bir, city, mail, tel):
    return "Имя " + name + " фамилия " + last_n + " год " + y_bir \
            + " город " + city + " почта " + mail + " телефон " + tel
name = input("Введите имя ")
last_n = input("Введите фамилию ")
y_bir = input("Введите год рождения ")
city = input("Введите город проживания ")
mail = input("Введите эл. почту ")
tel = input("Введите номер телефона ")
print(f"{inf(name, last_n, y_bir, city, mail, tel)}")
