"""
1. Реализовать скрипт, в котором должна быть предусмотрена функция
расчета заработной платы сотрудника. В расчете необходимо использовать формулу:
(выработка в часах*ставка в час) + премия. Для выполнения расчета для конкретных
значений необходимо запускать скрипт с параметрами.
"""

import sys
f_bj, n_v, r_v, h_v, d_v = sys.argv


def calculate_salary(rate, hours, days):
    print(f'Сотрудник {n_v} заработал {int(rate) * 1.2 * int(hours) * int(days) }')
    exit()


calculate_salary(r_v, h_v, d_v)

